&НаСервере 
Процедура СоздатьНоменклатуры()

 // определяем максимальное количество потоков 
 ЧислоПотоков = ЧислоПотоков;  //думаю хватит )
 // объем порции данных для обработки каждым потоком 
 РазмерПорции = Цел(КоличествоСоздаваемыхНоменклатурныхПозиций/ЧислоПотоков);
 // массив, где будут храниться фоновые задания 
 МассивЗаданий = Новый Массив;
 Для НомерПотока = 1 По ЧислоПотоков Цикл
	// определяем индекс для начала обработки данных данным потоком 
	// разные потоки обрабатывают разные части таблицы 
 	ИндексНачала = (НомерПотока - 1)*РазмерПорции;
 	Если (НомерПотока = ЧислоПотоков) Тогда
		// если это последний поток, то он обрабатывает все оставшиеся данные 
		// т.к. число потоков может не быть кратно количеству строк в таблице 
		РазмерПорции = КоличествоСоздаваемыхНоменклатурныхПозиций -(ЧислоПотоков*РазмерПорции)+РазмерПорции;
 	КонецЕсли;

 // определяем массив параметров для процедуры 
 НаборПараметров = Новый Массив;
 НаборПараметров.Добавить(ИндексНачала);
 НаборПараметров.Добавить(РазмерПорции);
 НаборПараметров.Добавить(ДоКудаСоздаватьСерийныеНомера);

 // запуск фонового задания 
 Задание = ФоновыеЗадания.Выполнить("ОбщийМодуль1.ДобавитьНоменклатуры", НаборПараметров);
 // добавляем задание в массив, чтобы потом отследить выполнение 
 МассивЗаданий.Добавить(Задание);
 КонецЦикла;

// проверим результат выполнения фоновых заданий 
Если МассивЗаданий.Количество() > 0 Тогда
	Попытка
		ФоновыеЗадания.ОжидатьЗавершения(МассивЗаданий);
		Сообщить("Готово!");
	Исключение
		// действия в случае ошибки 
		Сообщить("Не все выполнилось");
	КонецПопытки;
КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СоздатьNноменклатурныхПозиций(Команда)
	СоздатьНоменклатуры();
КонецПроцедуры


&НаКлиенте
Процедура СписокНоменклатурыПриАктивизацииСтроки(Элемент)
	СписокСерийныхНомеров.Параметры.УстановитьЗначениеПараметра("Владелец",Элемент.ТекущиеДанные.Ссылка);
КонецПроцедуры

