Процедура ДобавитьНоменклатуры (ИндексНачала,РазмерПорции,КоличествоДляСерийных) Экспорт

	i= ИндексНачала+1;
	Пока i<=ИндексНачала+РазмерПорции Цикл
		СсылкаНаНоменклатуру = НайтиИлиСоздатьНоменклатуру(i);
	
		Если  i > КоличествоДляСерийных Тогда
			i=i+1;
    		Продолжить;
		КонецЕсли;
		
		j=1 ;
		Пока j<=3 Цикл
			// ------------------------------------------------------
			НайтиИлиСОздатьСерийныйНомерНоменклатуры(i,j,СсылкаНаНоменклатуру);  			
			//-----------------------------------------------------------
			j=j+1;
		КонецЦикла;	
		i=i+1;
		
	КонецЦикла;
   КонецПроцедуры

   
 Функция НайтиИлиСоздатьНоменклатуру(i)
	 //Проверим, может такая уже есть 
	 Наим=Строка(Формат(i,"ЧГ=0")); 		
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	Номенклатура.Ссылка КАК Ссылка
	 |ИЗ
	 |	Справочник.Номенклатура КАК Номенклатура
	 |ГДЕ
	 |	НЕ Номенклатура.ПометкаУдаления
	 |	И Номенклатура.Наименование = &Наименование";
	 
	 Запрос.УстановитьПараметр("Наименование", Наим);
	 
	 Результат = Запрос.Выполнить();
	 Если НЕ Результат.Пустой() Тогда
		 Выборка =Результат.Выбрать(); 
		 Выборка.Следующий();
		 СсылкаНаНоменклатуру =Выборка.Ссылка; 
		 Возврат    СсылкаНаНоменклатуру;
	 КонецЕсли;
	 
	 НовыйЭлемент=Справочники.Номенклатура.СоздатьЭлемент();
	 НовыйЭлемент.Наименование = Наим;
	 НовыйЭлемент.Записать();
	 СсылкаНаНоменклатуру= НовыйЭлемент.Ссылка;
	 
	 Возврат  СсылкаНаНоменклатуру;
	 
 КонецФункции
 
   
Процедура НайтиИлиСОздатьСерийныйНомерНоменклатуры(i,j,Владелец)   
   Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	СерийныеНомера.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.СерийныеНомера КАК СерийныеНомера
			|ГДЕ
			|	СерийныеНомера.Владелец = &Владелец 
		    |	И НЕ СерийныеНомера.ПометкаУдаления
			|	И СерийныеНомера.Наименование = &Наименование";
			
			Запрос.УстановитьПараметр("Владелец", Владелец);
			Запрос.УстановитьПараметр("Наименование", Строка(Формат(j,"ЧГ=0"))+" "+Строка(Формат(i,"ЧГ=0")));
			
			РезультатЗапроса = Запрос.Выполнить();
			Если  НЕ РезультатЗапроса.Пустой() Тогда //значит такой серийник уже есть
				Возврат;
			Иначе
				НовЭл=Справочники.СерийныеНомера.СоздатьЭлемент();
				НовЭл.Владелец = Владелец;
				НовЭл.Наименование = Строка(Формат(j,"ЧГ=0"))+" "+Строка(Формат(i,"ЧГ=0"));
				НовЭл.Записать();
			КонецЕсли;	    	
   
КонецПроцедуры
   