
Процедура ОбработкаПроведения(Отказ, Режим)
	
    Движения.Остатки.Очистить();
	Движения.Остатки.Записывать = Истина; 
	Движения.Записать(); 
	
	Движения.Взаиморасчеты.Очистить();
	Движения.Взаиморасчеты.Записывать = Истина;
	Движения.Записать(); 	
	
	СуммаДокумента = 0;  
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТовары.Номенклатура КАК Номенклатура,
		|	СУММА(РеализацияТовары.Количество) КАК Количество,
		|	СУММА(РеализацияТовары.Сумма) КАК Сумма,
		|	МИНИМУМ(РеализацияТовары.НомерСтроки) КАК НомерСтроки
		|ПОМЕСТИТЬ ВТ_ТоварыИзНакладной
		|ИЗ
		|	Документ.Реализация.Товары КАК РеализацияТовары
		|ГДЕ
		|	РеализацияТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацияТовары.Номенклатура
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	РеализацияТовары.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТоварыИзНакладной.Номенклатура КАК Номенклатура,
		|	ВТ_ТоварыИзНакладной.Количество КАК КоличествоПродажи,
		|	ВТ_ТоварыИзНакладной.НомерСтроки КАК НомерСтроки,
		|	ВТ_ТоварыИзНакладной.Сумма КАК СуммаПродажи,
		|	ЕСТЬNULL(ОстаткиТоваровНаСкладе.КоличествоОстаток, 0) КАК КоличествоОстаток,
		|	ОстаткиТоваровНаСкладе.Номенклатура.Представление КАК НоменклатураПредставление
		|ИЗ
		|	ВТ_ТоварыИзНакладной КАК ВТ_ТоварыИзНакладной
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ОстаткиТоваров.Номенклатура КАК Номенклатура,
		|			ОстаткиТоваров.КоличествоОстаток КАК КоличествоОстаток
		|		ИЗ
		|			РегистрНакопления.Остатки.Остатки(
		|					&МоментВремени,
		|					Номенклатура В
		|							(ВЫБРАТЬ
		|								ВТ_ТоварыИзНакладной.Номенклатура
		|							ИЗ
		|								ВТ_ТоварыИзНакладной)
		|						И Склад = &Склад) КАК ОстаткиТоваров) КАК ОстаткиТоваровНаСкладе
		|		ПО ВТ_ТоварыИзНакладной.Номенклатура = ОстаткиТоваровНаСкладе.Номенклатура";
	
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ПроверкаОстатковУспешна = Истина;
	Пока Выборка.Следующий() Цикл
		СуммаДокумента = СуммаДокумента + Выборка.СуммаПродажи;  
		
		Если  Выборка.КоличествоОстаток < Выборка.КоличествоПродажи Тогда
		     Сообщение = Новый СообщениеПользователю;
			 Сообщение.Текст = "Не хватает товара """ + Выборка.НоменклатураПредставление + """. На складе осталось только " + Выборка.КоличествоОстаток;
			 Сообщение.Поле ="Товары.[" + Выборка.НомерСтроки + "].Количество";
			 Сообщение.УстановитьДанные(ЭтотОбъект);
			 Сообщение.Сообщить();
			 Отказ=Истина;
		КонецЕсли;
		
		Если Отказ Тогда
		    Продолжить;	
		КонецЕсли;						
		 
			Движение = Движения.Остатки.ДобавитьРасход();
			Движение.Период = Дата;
            Движение.Номенклатура = Выборка.Номенклатура;
			Движение.Склад = Склад;
			Движение.Количество = Выборка.КоличествоПродажи; 	
		
	КонецЦикла;
	
	
	Движение = Движения.Взаиморасчеты.ДобавитьРасход();
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Договор = Договор;
	Движение.Сумма = СуммаДокумента;
	Движение.КодОперации = "Увеличение долга контрагента перед организацией";
	
	Движения.Остатки.Записывать = Истина; 
	Движения.Взаиморасчеты.Записывать = Истина;


КонецПроцедуры

