
&НаКлиенте
Процедура ПоменятьЧисловымиМетодами(Команда)
	a=a+b;  
	b=a-b;  
	a=a-b;	
КонецПроцедуры  


&НаКлиенте
Процедура ПоменятьСтроковымиФункциями(Команда)	
	    //постоянное приведение к строке необходимо из-за особого форматирования 1С-ом разрядности чисел пробелами
		//а так как нам приходится работать в условиях невозможности добавления 3ей переменной,
		//то вот так вот изголяемся, сначала постоянно форматируя число и приводя его потом к строке
		//если бы не было этой особенности, то код был бы короче
		a = Строка(Формат(a,"ЧГ=0")) + Строка(Формат(b,"ЧГ=0"));   
		b = Лев(Строка(Формат(a,"ЧГ=0")),СтрДлина(Строка(Формат(a,"ЧГ=0")))-СтрДлина(Строка(Формат(b,"ЧГ=0"))));  
		a = Сред(Строка(Формат(a,"ЧГ=0")),	 СтрДлина(Строка(Формат(b,"ЧГ=0")))+1);
		
КонецПроцедуры

