
&НаКлиенте
Процедура ЦеныПродажи(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда   
		Сообщить ("Внимание! Номенклатура еще не записана в базу, вы не можете пока  вносить цены продажи для нее");
		Возврат;	
	КонецЕсли;
		
	Парам = Новый Структура; 
    Отбор = Новый Структура; 
    Отбор.Вставить("Номенклатура", Объект.Ссылка); 
	Парам.Вставить("Отбор", Отбор);
    ОткрытьФорму("РегистрСведений.ЦеныПродажи.ФормаСписка", Парам,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры
