Процедура ПриСозданииНаСервере(Форма) ЭКСПОРТ
	
	КЧ102 = Новый КвалификаторыЧисла(10,2);
	Массив = Новый Массив;
	Массив.Добавить(Тип("Число"));
	ОписаниеТиповЧ102 = Новый ОписаниеТипов(Массив, , ,КЧ102);
	КЧ20 = Новый КвалификаторыЧисла(4,2);
	Массив = Новый Массив;
	Массив.Добавить(Тип("Число"));
	ОписаниеТиповЧ20 = Новый ОписаниеТипов(Массив, , ,КЧ20);
 	КЧ152 = Новый КвалификаторыЧисла(15,2);
	Массив = Новый Массив;
	Массив.Добавить(Тип("Число"));
	ОписаниеТиповЧ152 = Новый ОписаниеТипов(Массив, , ,КЧ152);

	
	
	МассивДобавляемыхРеквизитов = Новый Массив;     
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ЦенаСоСкидкой",
													ОписаниеТиповЧ102,"Объект.Товары" ,"ЦенаСоСкидкой")); 
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ПроцентСкидки",
													ОписаниеТиповЧ20,"Объект.Товары" ,"ПроцентСкидки")); 
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("СуммаСкидки",
													ОписаниеТиповЧ152,"Объект.Товары" ,"СуммаСкидки")); 
												
	
	Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);         

	ЭлементыФормы = Форма.Элементы ;
	НоваяКолонка = ЭлементыФормы.Добавить("ЭлементЦенаСоСкидкой", Тип("ПолеФормы"), ЭлементыФормы.Товары); 
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	НоваяКолонка.РежимРедактирования = РежимРедактированияКолонки.ВходПриВводе;  
	НоваяКолонка.Заголовок = "ЦенаСоСкидкой"; 
	НоваяКолонка.ПутьКДанным = "Объект.Товары.ЦенаСоСкидкой";  
	НоваяКолонка.УстановитьДействие("ПриИзменении","ТоварыЦенаСоСкидкойПриИзменении");
	//--
	НоваяКолонка = ЭлементыФормы.Добавить("ЭлементПроцентСкидки", Тип("ПолеФормы"), ЭлементыФормы.Товары); 
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	НоваяКолонка.РежимРедактирования = РежимРедактированияКолонки.ВходПриВводе;  
	НоваяКолонка.Заголовок = "ПроцентСкидки"; 
	НоваяКолонка.ПутьКДанным = "Объект.Товары.ПроцентСкидки"; 
	НоваяКолонка.УстановитьДействие("ПриИзменении","ТоварыПроцентСкидкиПриИзменении");
	//--
	НоваяКолонка = ЭлементыФормы.Добавить("ЭлементСуммаСкидки", Тип("ПолеФормы"), ЭлементыФормы.Товары); 
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
	НоваяКолонка.РежимРедактирования = РежимРедактированияКолонки.ВходПриВводе;  
	НоваяКолонка.Заголовок = "СуммаСкидки"; 
	НоваяКолонка.ПутьКДанным = "Объект.Товары.СуммаСкидки";
   	НоваяКолонка.УстановитьДействие("ПриИзменении","ТоварыСуммаСкидкиПриИзменении");

	
КонецПроцедуры


