
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.Остатки.Записывать = Истина;
	Движения.Взаиморасчеты.Записывать = Истина;
	
	СуммаДокумента = 0;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		
		СуммаДокумента = СуммаДокумента + ТекСтрокаТовары.Сумма;
		
		Движение = Движения.Остатки.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Склад = Склад;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Количество = ТекСтрокаТовары.Количество;
		
		
	КонецЦикла;
	
	Движение = Движения.Взаиморасчеты.ДобавитьПриход();
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Договор = Договор;
	Движение.Сумма = СуммаДокумента;
	Движение.КодОперации = "Увеличение долга перед контрагентом";
	
	
КонецПроцедуры

